In [39]:
import pandas as pd
import numpy as np

In [80]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/beer.txt')
df.head()

  name calories sodium alcohol cost
0         Budweiser 144 15 4.7 0.43
1           Schlitz 151 19 4.9 0.43
2         Lowenbrau 157 15 0.9 0.48
3        Kronenbourg 170 7 5.2 0.73
4          Heineken 152 11 5.0 0.77

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 1 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   name calories sodium alcohol cost  20 non-null     object
dtypes: object(1)
memory usage: 288.0+ bytes

In [82]:
#splitting all the columns
df[['name','calories','sodium','alcohol','cost']] = df['name calories sodium alcohol cost'].str.split(" ",expand=True,)

In [83]:
df.head()

  name calories sodium alcohol cost         name calories sodium alcohol  cost
0         Budweiser 144 15 4.7 0.43    Budweiser      144     15     4.7  0.43
1           Schlitz 151 19 4.9 0.43      Schlitz      151     19     4.9  0.43
2         Lowenbrau 157 15 0.9 0.48    Lowenbrau      157     15     0.9  0.48
3        Kronenbourg 170 7 5.2 0.73  Kronenbourg      170      7     5.2  0.73
4          Heineken 152 11 5.0 0.77     Heineken      152     11     5.0  0.77

In [84]:
df1 = df.drop(['name calories sodium alcohol cost'], axis = 1)
df1.head()
df.dtypes

name calories sodium alcohol cost    object
name                                 object
calories                             object
sodium                               object
alcohol                              object
cost                                 object
dtype: object

In [85]:
df1['cost'] = df1['cost'].str[2:]
df1.head()

          name calories sodium alcohol cost
0    Budweiser      144     15     4.7   43
1      Schlitz      151     19     4.9   43
2    Lowenbrau      157     15     0.9   48
3  Kronenbourg      170      7     5.2   73
4     Heineken      152     11     5.0   77

In [91]:
cols = df1.columns.drop('name')
df1.head()

          name calories sodium alcohol cost
0    Budweiser      144     15     4.7   43
1      Schlitz      151     19     4.9   43
2    Lowenbrau      157     15     0.9   48
3  Kronenbourg      170      7     5.2   73
4     Heineken      152     11     5.0   77

In [94]:
#changing data types of columns
df1[cols] = df1[cols].apply(pd.to_numeric, errors='coerce')
df1.dtypes

name         object
calories      int64
sodium        int64
alcohol     float64
cost          int64
dtype: object

In [95]:
#finding out the costliest item
df1.sort_values(by = "cost", ascending = False).head(1)

     name  calories  sodium  alcohol  cost
14  Kirin       149       6      5.0    79